InformationRegisters/ДополнительныеСвойстваЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.ДополнительныеСвойстваЗаказа" category="Record">				<xr:TypeId>a6d979ca-9631-4538-935b-7ec25cbe96fe</xr:TypeId>				<xr:ValueId>fc450f29-13ca-4da6-8579-d3e9e7651066</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.ДополнительныеСвойстваЗаказа" category="Manager">				<xr:TypeId>92ee3c67-7082-4baa-b72b-63f8bfd63a63</xr:TypeId>				<xr:ValueId>3015d17f-80c7-44f4-bea3-5c2e8128d6af</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.ДополнительныеСвойстваЗаказа" category="Selection">				<xr:TypeId>fd2cac1f-9fdf-4d6d-af1d-ad1399f6e162</xr:TypeId>				<xr:ValueId>4ccb125b-6080-4d56-a137-d893547d447e</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.ДополнительныеСвойстваЗаказа" category="List">				<xr:TypeId>51340d0b-2cb1-4de9-8787-08240eecc095</xr:TypeId>				<xr:ValueId>07ac2fbe-7364-44ff-8fd0-9a2f0e8f214f</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.ДополнительныеСвойстваЗаказа" category="RecordSet">				<xr:TypeId>7a290b82-d0ed-4baf-8648-43a5031fb6fa</xr:TypeId>				<xr:ValueId>03f671c4-ac66-48c5-8c84-54fe1da610e2</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.ДополнительныеСвойстваЗаказа" category="RecordKey">				<xr:TypeId>86d227fa-e2e4-47f6-b8de-6e835b519315</xr:TypeId>				<xr:ValueId>f158cb97-c323-4a4d-a69c-030c1450f679</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.ДополнительныеСвойстваЗаказа" category="RecordManager">				<xr:TypeId>6837b622-aa2c-434a-8adb-1af7b8383066</xr:TypeId>				<xr:ValueId>7fa100e9-40ff-438d-9004-732474346fae</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ДополнительныеСвойстваЗаказа</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Дополнительные свойства заказа</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Значение</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Значение</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыЗаказа</v8:TypeSet>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks>						<xr:Link>							<xr:Name>Отбор.Владелец</xr:Name>							<xr:DataPath>InformationRegister.ДополнительныеСвойстваЗаказа.Dimension.Свойство</xr:DataPath>							<xr:ValueChange>Clear</xr:ValueChange>						</xr:Link>					</ChoiceParameterLinks>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>true</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>true</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Свойство</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Свойство</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыЗаказа</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

CommonModules/ФункцииДляПользовательскихФормул/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Проверяет наличие записи в регистре сведений "ДополнительныеСвойстваЗаказа".
// Свойство и его значение определяется по наименованию.
//
// Параметры:
//  Заказ - СправочникСсылка.Заказы - проверяемый заказ.
//  ИмяСвойства - Строка - наименование дополнительного свойства.
//  ИмяЗначения - Строка - наименование значения дополнительного свойства.
//
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция СвойствоЗаказаРавно(Знач Заказ, Знач ИмяСвойства, Знач ИмяЗначения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ИмяЗначения", ИмяЗначения);
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСвойстваЗаказа.Заказ КАК Заказ,
		|	ДополнительныеСвойстваЗаказа.Свойство КАК Свойство,
		|	ДополнительныеСвойстваЗаказа.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСвойстваЗаказа КАК ДополнительныеСвойстваЗаказа
		|ГДЕ
		|	ДополнительныеСвойстваЗаказа.Заказ = &Заказ
		|	И ДополнительныеСвойстваЗаказа.Свойство.Наименование = &ИмяСвойства
		|	И ДополнительныеСвойстваЗаказа.Значение.Наименование = &ИмяЗначения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

//Обработать текст сообщения на двух языках и вывести сообщение на текущем языке
Функция ОбработатьТекстСообщения(Русский, English) Экспорт 	
	Русский = СтрЗаменить(Русский, "'", """");
	English = СтрЗаменить(English, "'", """");
	Возврат НСтрMES("ru='"+Русский+"';en='"+English+"'");	
КонецФункции

Функция ЕстьКонсерны(Заказ,НаименованиеИнспектируемогоЭлемента=Неопределено,НаименованиеДефекта=Неопределено) Экспорт
	ТекстСообщенияДетализация = "";
	ИнспектируемыйЭлемент = "";
	Дефект = "";
	
	Если ЗначениеЗаполнено(НаименованиеИнспектируемогоЭлемента) Тогда
		ИнспектируемыйЭлемент = Справочники.ИнспектируемыеЭлементы.НайтиПоНаименованию(НаименованиеИнспектируемогоЭлемента,Истина);
		Если ИнспектируемыйЭлемент = Справочники.ИнспектируемыеЭлементы.ПустаяСсылка() Тогда
			ВызватьИсключение НСтр("ru='Инспектируемый элемент с таким наименованием  ""';en='Inspected element with such name ""'")+НаименованиеИнспектируемогоЭлемента+НСтр("ru='"" не найден.';en='"" was not found'"); 		
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеДефекта) Тогда
		Дефект = Справочники.Дефекты.НайтиПоНаименованию(НаименованиеДефекта,Истина);
		Если Дефект = Справочники.Дефекты.ПустаяСсылка() Тогда
			ВызватьИсключение НСтр("ru='Дефект с таким наименованием  ""';en='Defect with such name ""'")+НаименованиеДефекта+НСтр("ru='"" не найден.';en='"" was not found'"); 		
		КонецЕсли;
	КонецЕсли;
	
	Возврат QNS.КонтрольНаличияОткрытыхКонсернов(Заказ, ТекстСообщенияДетализация,,ИнспектируемыйЭлемент,Дефект);
КонецФункции

Функция ЕстьКампании(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КампанииОстатки.Заказ,
		|	КампанииОстатки.Кампания,
		|	КампанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Кампании.Остатки(, Заказ = &Заказ) КАК КампанииОстатки";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

Функция ЕстьVBOM(Заказ, КодыНоменклатур) экспорт
	Возврат ФункцииДляПользовательскихФормулПовтИсп.ЕстьVBOM_Повт(Заказ, КодыНоменклатур);
КонецФункции

Функция ЕстьНекомплект(Заказ, НоменклатураИмя = Неопределено) экспорт
	Возврат ФункцииДляПользовательскихФормулПовтИсп.ЕстьНекомплект_Повт(Заказ, НоменклатураИмя);
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#КонецОбласти
